In [1]:
import pandas as pd
import csv

In [2]:
# The path to our CSV file
data = r"Bird_count.csv"

# Read our Bird_count data into pandas
bird_count_df = pd.read_csv(data)
bird_count_df.head()

   YEAR AREA REGION SPECIES      SPECIESNAME  COUNT
0  2003   18     nh    buff       Bufflehead     20
1  2003   18     nh    scot   Generic Scoter     20
2  2003   18     nh    scot   Generic Scoter    100
3  2003   19     nh    amwi  American Wigeon    100
4  2003   19     nh    scau    Generic Scaup    300

In [3]:
#  Create a new df for birdcount  with only the interested species

# creating filters of bool series from isin() 
filter1 = bird_count_df["SPECIESNAME"].isin(["American Coot","Northern Pintail","Northern Shoveler","Generic Scaup","Blue-winged or Cinnamon Teal",
"American Green-winged Teal","American Wigeon","Generic Whisling-Duck","Redhead","Gadwall"]) 

#filter2=bird_count_df["Team"].isin(["Engineering", "Distribution", "Finance" ]) 



birdcount= bird_count_df[filter1]
birdcount

       YEAR AREA REGION SPECIES        SPECIESNAME  COUNT
3      2003   19     nh    amwi    American Wigeon    100
4      2003   19     nh    scau      Generic Scaup    300
8      2003   19     nh    scau      Generic Scaup    300
10     2003   19     nh    scau      Generic Scaup     50
12     2003   19     nh    scau      Generic Scaup    500
...     ...  ...    ...     ...                ...    ...
67052  2006   54     lw    scau      Generic Scaup     80
67053  2006   54     lw    scau      Generic Scaup     40
67054  2006   61     lw    amwi    American Wigeon    200
67055  2006   61     lw    nsho  Northern Shoveler     10
67056  2006   54     lw    scau      Generic Scaup     75

[26723 rows x 6 columns]

In [4]:
birdcount.dtypes
print(type(filter1))

<class 'pandas.core.series.Series'>

In [7]:
#player_count = purchase_data.groupby([“SN”,“Gender”]).count()
#player_count.index

#birdcount1 = birdcount.groupby(["SPECIESNAME","YEAR","AREA","REGION"]).count()
#birdcount1["COUNT"].sum()
birdcount1 = birdcount.groupby(["SPECIESNAME","YEAR","AREA","REGION"])
birdcount2=birdcount1["COUNT"].sum()
birdcount2
print(type(birdcount2))

bc_df = birdcount2.to_frame()

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

                                COUNT
SPECIESNAME   YEAR AREA REGION
American Coot 1947 54   lw      12350
                   57   lw      25500
                   63   lw        330
                   65   ec        950
                   66   ec      30825

In [18]:
bc_df_csv_df = pd.read_csv("bc_csv.csv")  
bc_df_csv_df.head()

     SPECIESNAME  YEAR AREA REGION  COUNT
0  American Coot  1947   54     lw  12350
1  American Coot  1947   57     lw  25500
2  American Coot  1947   63     lw    330
3  American Coot  1947   65     ec    950
4  American Coot  1947   66     ec  30825

In [20]:
# using the replace() method 
bc_df_csv_df.replace(to_replace ="ec", value = "East Coast",  inplace = True) 
bc_df_csv_df.replace(to_replace ="ch", value = "Central High", inplace = True) 
bc_df_csv_df.replace(to_replace ="nh", value = "Northwen Highlands", inplace = True) 
bc_df_csv_df.replace(to_replace ="lw", value = "Lower West Coast",inplace = True)
bc_df_csv_df.replace(to_replace ="oh", value = "Other interior highlands", inplace = True)
bc_df_csv_df.replace(to_replace ="uw", value = "Upper west coast",inplace = True)
  
# writing  the dataframe to another csv file 
bc_df_csv_df.to_csv('bc_df_csv_output.csv', index = False)

print("csv created")

csv created